In [1]:
import numpy as np
import pandas as pd

**Two types of object creation:-
i. Pandas - Series**

In [2]:
es=pd.Series()
es

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

Series([], dtype: float64)

In [3]:
s=pd.Series([2,4,6,8,10])
s

0     2
1     4
2     6
3     8
4    10
dtype: int64

**ii. Pandas Dataframe**

In [4]:
df=pd.DataFrame()

In [5]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [6]:
df1=pd.DataFrame([[1,2,3,4],[5,6,7,8],[2,7,3,23],[23,23,63,12],[5,34,7,16],[76,12,43,65]],columns=['A','B','C','D'])

In [7]:
df1

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3  23  23  63  12
4   5  34   7  16
5  76  12  43  65

In [8]:
df1.head

<bound method NDFrame.head of     A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3  23  23  63  12
4   5  34   7  16
5  76  12  43  65>

In [9]:
df1.head(3)

   A  B  C   D
0  1  2  3   4
1  5  6  7   8
2  2  7  3  23

In [10]:
df1.tail()

    A   B   C   D
1   5   6   7   8
2   2   7   3  23
3  23  23  63  12
4   5  34   7  16
5  76  12  43  65

In [11]:
df1.tail(4)

    A   B   C   D
2   2   7   3  23
3  23  23  63  12
4   5  34   7  16
5  76  12  43  65

In [12]:
df1.shape

(6, 4)

In [13]:
df1.to_numpy()

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 2,  7,  3, 23],
       [23, 23, 63, 12],
       [ 5, 34,  7, 16],
       [76, 12, 43, 65]], dtype=int64)

In [14]:
df1.T

   0  1   2   3   4   5
A  1  5   2  23   5  76
B  2  6   7  23  34  12
C  3  7   3  63   7  43
D  4  8  23  12  16  65

In [15]:
df1.sort_index(axis=1,ascending=False)

    D   C   B   A
0   4   3   2   1
1   8   7   6   5
2  23   3   7   2
3  12  63  23  23
4  16   7  34   5
5  65  43  12  76

**slicing and adding to a Dataframe**

In [16]:
df1.loc[[1,2],['C','D']]

   C   D
1  7   8
2  3  23

In [17]:
df1.loc[:,['C','D']]

    C   D
0   3   4
1   7   8
2   3  23
3  63  12
4   7  16
5  43  65

In [18]:
df1.loc[[1,2],:]

   A  B  C   D
1  5  6  7   8
2  2  7  3  23

In [19]:
df1.iloc[0,1]

2

In [20]:
df1.iloc[0:2,0:2]

   A  B
0  1  2
1  5  6

In [21]:
df1.iloc[1:3,2:4]

   C   D
1  7   8
2  3  23

In [22]:
df1=pd.DataFrame([[1,2,3,4],[5,6,7,8],[2,7,3,23],[23,23,63,12],[5,34,7,16],[76,12,43,65]],columns=['A','B','C','D'])

In [23]:
df1

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3  23  23  63  12
4   5  34   7  16
5  76  12  43  65

In [24]:
df1.loc[:,['D']]=None

In [25]:
df1

    A   B   C     D
0   1   2   3  None
1   5   6   7  None
2   2   7   3  None
3  23  23  63  None
4   5  34   7  None
5  76  12  43  None

In [26]:
df1.loc[:,['D']].isnull()

      D
0  True
1  True
2  True
3  True
4  True
5  True

In [27]:
df1.info

<bound method DataFrame.info of     A   B   C     D
0   1   2   3  None
1   5   6   7  None
2   2   7   3  None
3  23  23  63  None
4   5  34   7  None
5  76  12  43  None>

In [47]:
df1.describe

<bound method NDFrame.describe of     A   B   C     D
0   1   2   3  None
1   5   6   7  None
2   2   7   3  None
3  23  23  63  None
4   5  34   7  None
5  76  12  43  None>

**Reading A CSV file in Pandas**

In [28]:
df2=pd.read_csv('data.csv')

In [29]:
df2

,Date,Open,High,Low,Close,Adj Close,Volume
0,9/6/2019,10883.79981,10957.04981,10867.45020,10946.20020,10946.20020,497200.0
1,9/9/2019,10936.70020,11028.84961,10889.79981,11003.04981,11003.04981,412500.0
2,9/11/2019,11028.50000,11054.79981,11011.65039,11035.70020,11035.70020,687100.0
3,9/12/2019,11058.29981,11081.75000,10964.95020,10982.79981,10982.79981,551400.0
4,9/13/2019,10986.79981,11084.45020,10945.75000,11075.90039,11075.90039,624300.0
...,...,...,...,...,...,...,...
242,8/31/2020,11777.54981,11794.25000,11325.84961,11387.50000,11387.50000,1371800.0
243,9/1/2020,11464.29981,11553.54981,11366.90039,11470.25000,11470.25000,783800.0
244,9/2/2020,11478.54981,11554.75000,11430.40039,11535.00000,11535.00000,593500.0
245,9/3/2020,11566.20020,11584.95020,11507.65039,11527.45020,11527.45020,607100.0
246,9/4/2020,11354.40039,11452.04981,11303.65039,11333.84961,11333.84961,0.0

In [30]:
df2.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,9/6/2019,10883.79981,10957.04981,10867.45020,10946.20020,10946.20020,497200.0
1,9/9/2019,10936.70020,11028.84961,10889.79981,11003.04981,11003.04981,412500.0
2,9/11/2019,11028.50000,11054.79981,11011.65039,11035.70020,11035.70020,687100.0
3,9/12/2019,11058.29981,11081.75000,10964.95020,10982.79981,10982.79981,551400.0
4,9/13/2019,10986.79981,11084.45020,10945.75000,11075.90039,11075.90039,624300.0

In [31]:
df2.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
242,8/31/2020,11777.54981,11794.25000,11325.84961,11387.50000,11387.50000,1371800.0
243,9/1/2020,11464.29981,11553.54981,11366.90039,11470.25000,11470.25000,783800.0
244,9/2/2020,11478.54981,11554.75000,11430.40039,11535.00000,11535.00000,593500.0
245,9/3/2020,11566.20020,11584.95020,11507.65039,11527.45020,11527.45020,607100.0
246,9/4/2020,11354.40039,11452.04981,11303.65039,11333.84961,11333.84961,0.0

In [32]:
df2['Date'].dtype

dtype('O')

In [33]:
print(df2['Date'].dtype)

object

In [34]:
df2['Open']

0      10883.79981
1      10936.70020
2      11028.50000
3      11058.29981
4      10986.79981
          ...
242    11777.54981
243    11464.29981
244    11478.54981
245    11566.20020
246    11354.40039
Name: Open, Length: 247, dtype: float64

In [35]:
df2['Open'].dtype

dtype('float64')

In [36]:
df2['Date'].astype('category')

0       9/6/2019
1       9/9/2019
2      9/11/2019
3      9/12/2019
4      9/13/2019
         ...
242    8/31/2020
243     9/1/2020
244     9/2/2020
245     9/3/2020
246     9/4/2020
Name: Date, Length: 247, dtype: category
Categories (247, object): [1/1/2020, 1/10/2020, 1/13/2020, 1/14/2020, ..., 9/30/2019, 9/4/2020, 9/6/2019, 9/9/2019]

In [37]:
df2['Open'].astype('category')

0      10883.79981
1      10936.70020
2      11028.50000
3      11058.29981
4      10986.79981
          ...
242    11777.54981
243    11464.29981
244    11478.54981
245    11566.20020
246    11354.40039
Name: Open, Length: 247, dtype: category
Categories (244, float64): [7735.149902, 7848.299805, 7945.700195, 8063.299805, ..., 12333.09961, 12347.09961, 12349.40039, 12430.50000]

**Writing A CSV file in Pandas**

**index=False is used to eliminate index when it is not required**

In [38]:
df1.to_csv('export.csv',index=False)

**Merging DataFrames using Python**

In [39]:
df1

    A   B   C     D
0   1   2   3  None
1   5   6   7  None
2   2   7   3  None
3  23  23  63  None
4   5  34   7  None
5  76  12  43  None

In [40]:
df1.index

RangeIndex(start=0, stop=6, step=1)

In [41]:
df1.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [42]:
df3=pd.DataFrame([[90,2,43,21],[32,6,98,65],[88,7,32,12],[56,23,95,34],[77,34,38,15],[50,12,39,28]],columns=['V','X','Y','Z'])

In [43]:
df3

    V   X   Y   Z
0  90   2  43  21
1  32   6  98  65
2  88   7  32  12
3  56  23  95  34
4  77  34  38  15
5  50  12  39  28

In [44]:
df4=pd.merge(df1,df3,right_on='X',left_on='B')

In [45]:
df4

    A   B   C     D   V   X   Y   Z
0   1   2   3  None  90   2  43  21
1   5   6   7  None  32   6  98  65
2   2   7   3  None  88   7  32  12
3  23  23  63  None  56  23  95  34
4   5  34   7  None  77  34  38  15
5  76  12  43  None  50  12  39  28

In [46]:
df4.size

48